#
#  TEXT ON BUTTONS
#

LK_BUTTON = "Личный кабинет"
CONTACTS_BUTTON = "Контакты"
INVITE_BUTTON = "Пригласить друга"
GET_SKINS_BUTTON = "Вывести скины"

TRADE_LINK_BUTTON = "Изменить вашу трейд-ссылку"

AGREE_BUTTON = "Подтвердить"

BACK_BUTTON = "Назад"

#
#   TEXTS IN MENUS
#


MAIN_MENU_TEXT = "Hello мир"
LK_TEXT = """
--- Личный кабинет ---
Трейд ссылка: {}
Баланс монет: {}
Количество приглашенных: {}
"""
GET_SKINS_TEXT = """
При нажатии кнопки "Подтвердить", запрос на вывод скинов будет передан админу
1 монета = 1 скин или наклейка

Трейд ссылка: {}
Баланс монет: {} 

Изменить трейд ссылку можно в личном кабинете
Монеты вы получаете за приглашённых по вашей реферальной ссылке пользователей
"""

INVITE_FRIENDS_TEXT = """
Вот ваша реферальная ссылка, каждый приглашенный друг даёт вам одну монет
https://t.me/reminder_news_bot?start={}
"""

#
#    SPECIAL TEXTS
#

ASK_FOR_TRADE_LINK = "Введите вашу трейд-ссылку"
SUCCESS_TRADE_LINK = "Успех!"
INVALID_TRADE_LINK = "Ваша ссылка invalid"

BAD_LINK_REQUEST = """
Пожалуйста, укажите ссылку в личном кабинете и попробуйте заново!
"""
BAD_BALANCE_REQUEST = """
У вас недостаточно монет, пригласите друзей и попробуйте еще раз!
"""
GOOD_REQUEST = """
Успех!
Вам придет уведомление, когда админ обработает ваш запрос
"""


#
#   ADMIN TEXTS
#

KEYWORD = 'Админ'

HELLO_ADMIN_TEXT = "Добро пожаловать в админку!"

MAKE_SENDING_BUTTON = "Создать рассылку"
TICKETS_BUTTON = "Запросы на вывод скинов"
EXIT_ADMIN_MODE_BUTTON = "Выйти из режима админа"

MAKE_SENDING_TEXT = "Введите сообщение для рассылки"
CONFIRM_SENDING_TEXT = """
Так будет выглядить ваше сообщение
"""
AGREE_SENDING_BUTTON = """Подтвердить и начать рассылку"""
CHANGE_MESSAGE_BUTTON = """Изменить сообщение"""

SUCCESS_SENDING = """
Рассылка успешно завершена
количество доставленных сообщений: {}
"""

HELLO_TICKETS_TEXT = """
Просмотр запросов на вывод скинов
количество запросов: {}
"""
SHOW_TICKETS_BUTTON = "Показать запросы"

SHOWING_TICKETS_TEXT = """
id тикета: {}

Количество монет: {}
Пользователь: @{}
Трейд-ссылка: {}
"""

NEXT_BUTTON = "Следующий"
MARK_COMPLETE_BUTTON = "Отметить как выполненное"
REJECT_BUTTON = "Данные некорректны"
PROCESSED_REQUEST_TEXT = "Отлично, пользователь будет уведомлён об этом"

YOUR_REQUEST_COMPLETED = "Админ закинул вам скинов на аккаунт!"
YOUR_REQUEST_REJECTED = """Указанная вами трейд-ссылка была некорректна,
поэтому запрос на вывод скинов был отклонён,
монеты зачислены вам назад на счёт"""

UNEXPECT_TEXT = "Пожалуйста, воспользуйтесь кнопками внизу экрана"

CONTACTS_TEXT = """
    это мы
"""
